results-shopcart-harness_2_0_0-native-run/result-2026-01-05-13:32:29/wrk2_results_20260105_133230.txt
Running 30s test @ http://shopcart:8001
  16 threads and 16 connections
  Thread calibration: mean lat.: 1.975ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.797ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.719ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.653ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.683ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.149ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.964ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.922ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.746ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.722ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.695ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.955ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.037ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.932ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.611ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.620ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.98ms    0.89ms  18.34ms   84.53%
    Req/Sec    52.51     51.86   222.00     83.36%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.85ms
 75.000%    2.29ms
 90.000%    2.79ms
 99.000%    5.07ms
 99.900%   10.69ms
 99.990%   17.42ms
 99.999%   18.35ms
100.000%   18.35ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.346     0.000000            1         1.00
       1.178     0.100000         1599         1.11
       1.392     0.200000         3194         1.25
       1.564     0.300000         4794         1.43
       1.712     0.400000         6394         1.67
       1.854     0.500000         7991         2.00
       1.928     0.550000         8790         2.22
       2.007     0.600000         9582         2.50
       2.089     0.650000        10389         2.86
       2.179     0.700000        11191         3.33
       2.287     0.750000        11995         4.00
       2.347     0.775000        12376         4.44
       2.409     0.800000        12786         5.00
       2.475     0.825000        13181         5.71
       2.555     0.850000        13573         6.67
       2.657     0.875000        13973         8.00
       2.715     0.887500        14172         8.89
       2.785     0.900000        14376        10.00
       2.853     0.912500        14572        11.43
       2.949     0.925000        14772        13.33
       3.053     0.937500        14974        16.00
       3.133     0.943750        15071        17.78
       3.227     0.950000        15171        20.00
       3.339     0.956250        15270        22.86
       3.467     0.962500        15370        26.67
       3.631     0.968750        15469        32.00
       3.717     0.971875        15520        35.56
       3.839     0.975000        15569        40.00
       3.977     0.978125        15620        45.71
       4.163     0.981250        15670        53.33
       4.419     0.984375        15719        64.00
       4.595     0.985938        15744        71.11
       4.807     0.987500        15769        80.00
       4.999     0.989062        15795        91.43
       5.171     0.990625        15819       106.67
       5.367     0.992188        15844       128.00
       5.651     0.992969        15856       142.22
       5.923     0.993750        15870       160.00
       6.023     0.994531        15881       182.86
       6.223     0.995313        15894       213.33
       6.731     0.996094        15906       256.00
       6.999     0.996484        15912       284.44
       7.343     0.996875        15919       320.00
       7.783     0.997266        15925       365.71
       8.151     0.997656        15931       426.67
       8.407     0.998047        15937       512.00
       8.503     0.998242        15940       568.89
       8.887     0.998437        15944       640.00
       9.039     0.998633        15947       731.43
      10.263     0.998828        15950       853.33
      11.007     0.999023        15953      1024.00
      11.511     0.999121        15954      1137.78
      12.191     0.999219        15956      1280.00
      12.503     0.999316        15958      1462.86
      12.895     0.999414        15959      1706.67
      14.343     0.999512        15961      2048.00
      14.343     0.999561        15961      2275.56
      15.663     0.999609        15962      2560.00
      15.759     0.999658        15963      2925.71
      16.111     0.999707        15964      3413.33
      16.575     0.999756        15965      4096.00
      16.575     0.999780        15965      4551.11
      16.575     0.999805        15965      5120.00
      17.423     0.999829        15966      5851.43
      17.423     0.999854        15966      6826.67
      18.271     0.999878        15967      8192.00
      18.271     0.999890        15967      9102.22
      18.271     0.999902        15967     10240.00
      18.271     0.999915        15967     11702.86
      18.271     0.999927        15967     13653.33
      18.351     0.999939        15968     16384.00
      18.351     1.000000        15968          inf
#[Mean    =        1.978, StdDeviation   =        0.889]
#[Max     =       18.336, Total count    =        15968]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24000 requests in 29.96s, 11.24MB read
  Non-2xx or 3xx responses: 11960
Requests/sec:    801.01
Transfer/sec:    384.22KB